require "socket"

#世代 -g 1~9,GO,LEGENDS
def generation number
    if number=="1"
        return ["ポケモン 第1世代 (カントー地方)","ソフト名：赤,緑,青,ピカチュウ,Let's Go! ピカチュウ,Let's Go! イーブイ","図鑑No.1~151"]
    elsif number=="2"
        return ["ポケモン 第2世代 (ジョウト地方)","ソフト名：金,銀,クリスタルバージョン","図鑑No.152~251"]
    elsif number=="3"
        return ["ポケモン 第3世代 (ホウエン地方)","ソフト名：ルビー,サファイア,ファイアレッド,リーフグリーン,エメラルド","図鑑No.252~386"]
    elsif number=="4"
        return ["ポケモン 第4世代 (シンオウ地方)","ソフト名：ダイヤモンド,パール,プラチナ,ハートゴールド,ソウルシルバー,ブリリアントダイヤモンド,シャイニングパール","図鑑No.387~493"]
    elsif number=="5"
        return ["ポケモン 第5世代 (イッシュ地方)","ブラック,ホワイト,ブラック2,ホワイト2","図鑑No.494~649"]
    elsif number=="6"
        return ["ポケモン 第6世代 (カロス地方)","X,Y,オメガルビー,アルファサファイア","図鑑No.650~721"]
    elsif number=="7"
        return ["ポケモン 第7世代 (アローラ地方)","サン,ムーン,ウルトラサン,ウルトラムーン","図鑑No.722~807"]
    elsif number=="GO"
        return ["ポケモン GO","図鑑No.808-809"]
    elsif number=="8"
        return ["ポケモン 第8世代 (ガラル地方)","ソード,シールド,ソード・シールドエキスパンションパス","図鑑No.810~898"]
    elsif number=="LEGENDS"
        return ["Pokemon LEGENDS アルセウス", "図鑑No.899~905"]
    elsif number=="9"
        return ["ポケモン 第9世代 (パルデア地方)","スカーレット,バイオレット","図鑑No.906~1010"]
    else
        return ["その世代は存在しません", "第1~9世代,GO,LEGENDS 指定してください"]
    end
end

#図鑑No -p 1~1010
def pictorial number
    num = number.to_i #指定された図鑑No

    #ポケモン一覧
    #第1世代
    poke_name1 = ["フシギダネ","フシギソウ","フシギバナ","ヒトカゲ","リザード","リザードン","ゼニガメ","カメール","カメックス","キャタピー",
                 "トランセル","バタフリー","ビードル","コクーン","スピアー","ポッポ","ピジョン","ピジョット","コラッタ","ラッタ",
                 "オニスズメ","オニドリル","アーボ","アーボック","ピカチュウ","ライチュウ","サンド","サンドパン","ニドラン♀","ニドリーナ",
                 "ニドクイン","ニドラン♂","ニドリーノ","ニドキング","ピッピ","ピクシー","ロコン","キュウコン","プリン","プクリン",
                 "ズバット","ゴルバット","ナゾノクサ","クサイハナ","ラフレシア","パラス","パラセクト","コンパン","モルフォン","ディグダ",
                 "ダグトリオ","ニャース","ペルシアン","コダック","ゴルダック","マンキー","オコリザル","ガーディ","ウインディ","ニョロモ",
                 "ニョロゾ","ニョロボン","ケーシィ","ユンゲラー","フーディン","ワンリキー","ゴーリキー","カイリキー","マダツボミ","ウツドン",
                 "ウツボット","メノクラゲ","ドククラゲ","イシツブテ","ゴローン","ゴローニャ","ポニータ","ギャロップ","ヤドン","ヤドラン",
                 "コイル","レアコイル","カモネギ","ドードー","ドードリオ","パウワウ","ジュゴン","ベトベター","ベトベトン","シェルダー",
                 "パルシェン","ゴース","ゴースト","ゲンガー","イワーク","スリープ","スリーパー","クラブ","キングラー","ビリリダマ",
                 "マルマイン","タマタマ","ナッシー","カラカラ","ガラガラ","サワムラー","エビワラー","ベロリンガ","ドガース","マタドガス",
                 "サイホーン","サイドン","ラッキー","モンジャラ","ガルーラ","タッツー","シードラ","トサキント","アズマオウ","ヒトデマン",
                 "スターミー","バリヤード","ストライク","ルージュラ","エレブー","ブーバー","カイロス","ケンタロス","コイキング","ギャラドス",
                 "ラプラス","メタモン","イーブイ","シャワーズ","サンダース","ブースター","ポリゴン","オムナイト","オムスター","カブト",
                 "カブトプス","プテラ","カビゴン","フリーザー","サンダー","ファイヤー","ミニリュウ","ハクリュー","カイリュー","ミュウツー",
                 "ミュウ"]
    #第2世代
    poke_name2 = ["チコリータ","ベイリーフ","メガニウム","ヒノアラシ","マグマラシ","バクフーン","ワニノコ","アリゲイツ","オーダイル",
                 "オタチ","オオタチ","ホーホー","ヨルノズク","レディバ","レディアン","イトマル","アリアドス","クロバット","チョンチー",
                 "ランターン","ピチュー","ピィ","ププリン","トゲピー","トゲチック","ネイティ","ネイティオ","メリープ","モココ",
                 "デンリュウ","キレイハナ","マリル","マリルリ","ウソッキー","ニョロトノ","ハネッコ","ポポッコ","ワタッコ","エイパム",
                 "ヒマナッツ","キマワリ","ヤンヤンマ","ウパー","ヌオー","エーフィ","ブラッキー","ヤミカラス","ヤドキング","ムウマ",
                 "アンノーン","ソーナンス","キリンリキ","クヌギダマ","フォレトス","ノコッチ","グライガー","ハガネール","ブルー","グランブル",
                 "ハリーセン","ハッサム","ツボツボ","ヘラクロス","ニューラ","ヒメグマ","リングマ","マグマッグ","マグカルゴ","ウリムー",
                 "イノムー","サニーゴ","テッポウオ","オクタン","デリバード","マンタイン","エアームド","デルビル","ヘルガー","キングドラ",
                 "ゴマゾウ","ドンファン","ポリゴン2","オドシシ","ドーブル","バルキー","カポエラー","ムチュール","エレキッド","ブビィ",
                 "ミルタンク","ハピナス","ライコウ","エンテイ","スイクン","ヨーギラス","サナギラス","バンギラス","ルギア","ホウオウ",
                 "セレビィ"]
    #第3世代
    poke_name3 = ["キモリ","ジュプトル","ジュカイン","アチャモ","ワカシャモ","バシャーモ","ミズゴロウ","ヌマクロー","ラグラージ",
                 "ポチエナ","グラエナ","ジグザグマ","マッスグマ","ケムッソ","カラサリス","アゲハント","マユルド","ドクケイル","ハスボー",
                 "ハスブレロ","ルンパッパ","タネボー","コノハナ","ダーテング","スバメ","オオスバメ","キャモメ","ペリッパー","ラルトス",
                 "キルリア","サーナイト","アメタマ","アメモース","キノココ","キノガッサ","ナマケロ","ヤルキモノ","ケッキング","ツチニン",
                 "テッカニン","ヌケニン","ゴニョニョ","ドゴーム","バクオング","マクノシタ","ハリテヤマ","ルリリ","ノズパス","エネコ",
                 "エネコロロ","ヤミラミ","クチート","ココドラ","コドラ","ボスゴドラ","アサナン","チャーレム","ラクライ","ライボルト",
                 "プラスル","マイナン","バルビート","イルミーゼ","ロゼリア","ゴクリン","マルノーム","キバニア","サメハダー","ホエルコ",
                 "ホエルオー","ドンメル","バクーダ","コータス","バネブー","ブーピッグ","パッチール","ナックラー","ビブラーバ","フライゴン",
                 "サボネア","ノクタス","チルット","チルタリス","ザングース","ハブネーク","ルナトーン","ソルロック","ドジョッチ","ナマズン",
                 "ヘイガニ","シザリガー","ヤジロン","ネンドール","リリーラ","ユレイドル","アノプス","アーマルド","ヒンバス","ミロカロス",
                 "ポワルン","カクレオン","カゲボウズ","ジュペッタ","ヨマワル","サマヨール","トロピウス","チリーン","アブソル","ソーナノ",
                 "ユキワラシ","オニゴーリ","タマザラシ","トドグラー","トドゼルガ","パールル","ハンテール","サクラビス","ジーランス","ラブカス",
                 "タツベイ","コモルー","ボーマンダ","ダンバル","メタング","メタグロス","レジロック","レジアイス","レジスチル","ラティアス",
                 "ラティオス","カイオーガ","グラードン","レックウザ","ジラーチ","デオキシス"]
    #第4世代
    poke_name4 = ["ナエトル","ハヤシガメ","ドダイトス","ヒコザル",
                 "モウカザル","ゴウカザル","ポッチャマ","ポッタイシ","エンペルト","ムックル","ムクバード","ムクホーク","ビッパ","ビーダル",
                 "コロボーシ","コロトック","コリンク","ルクシオ","レントラー","スボミー","ロズレイド","ズガイドス","ラムパルド","タテトプス",
                 "トリデプス","ミノムッチ","ミノマダム","ガーメイル","ミツハニー","ビークイン","パチリス","ブイゼル","フローゼル","チェリンボ",
                 "チェリム","カラナクシ","トリトドン","エテボース","フワンテ","フワライド","ミミロル","ミミロップ","ムウマージ","ドンカラス",
                 "ニャルマー","ブニャット","リーシャン","スカンプー","スカタンク","ドーミラー","ドータンク","ウソハチ","マネネ","ピンプク",
                 "ペラップ","ミカルゲ","フカマル","ガバイト","ガブリアス","ゴンベ","リオル","ルカリオ","ヒポポタス","カバルドン",
                 "スコルピ","ドラピオン","グレッグル","ドクロッグ","マスキッパ","ケイコウオ","ネオラント","タマンタ","ユキカブリ","ユキノオー",
                 "マニューラ","ジバコイル","ベロベルト","ドサイドン","モジャンボ","エレキブル","ブーバーン","トゲキッス","メガヤンマ","リーフィア",
                 "グレイシア","グライオン","マンムー","ポリゴンZ","エルレイド","ダイノーズ","ヨノワール","ユキメノコ","ロトム","ユクシー",
                 "エムリット","アグノム","ディアルガ","パルキア","ヒードラン","レジギガス","ギラティナ","クレセリア","フィオネ","マナフィ",
                 "ダークライ","シェイミ","アルセウス"]
    #第5世代
    poke_name5 = ["ビクティニ","ツタージャ","ジャノビー","ジャローダ","ポカブ","チャオブー","エンブオー",
                 "ミジュマル","フタチマル","ダイケンキ","ミネズミ","ミルホッグ","ヨーテリー","ハーデリア","ムーランド","チョロネコ","レパルダス",
                 "ヤナップ","ヤナッキー","バオップ","バオッキー","ヒヤップ","ヒヤッキー","ムンナ","ムシャーナ","マメパト","ハトーボー",
                 "ケンホロウ","シママ","ゼブライカ","ダンゴロ","ガントル","ギガイアス","コロモリ","ココロモリ","モグリュー","ドリュウズ",
                 "タブンネ","ドッコラー","ドテッコツ","ローブシン","オタマロ","ガマガル","ガマゲロゲ","ナゲキ","ダゲキ","クルミル",
                 "クルマユ","ハハコモリ","フシデ","ホイーガ","ペンドラー","モンメン","エルフーン","チュリネ","ドレディア","バスラオ",
                 "メグロコ","ワルビル","ワルビアル","ダルマッカ","ヒヒダルマ","マラカッチ","イシズマイ","イワパレス","ズルッグ","ズルズキン",
                 "シンボラー","デスマス","デスカーン","プロトーガ","アバゴーラ","アーケン","アーケオス","ヤブクロン","ダストダス","ゾロア",
                 "ゾロアーク","チラーミィ","チラチーノ","ゴチム","ゴチミル","ゴチルゼル","ユニラン","ダブラン","ランクルス","コアルヒー",
                 "スワンナ","バニプッチ","バニリッチ","バイバニラ","シキジカ","メブキジカ","エモンガ","カブルモ","シュバルゴ","タマゲタケ",
                 "モロバレル","プルリル","ブルンゲル","ママンボウ","バチュル","デンチュラ","テッシード","ナットレイ","ギアル","ギギアル",
                 "ギギギアル","シビシラス","シビビール","シビルドン","リグレー","オーベム","ヒトモシ","ランプラー","シャンデラ","キバゴ",
                 "オノンド","オノノクス","クマシュン","ツンベアー","フリージオ","チョボマキ","アギルダー","マッギョ","コジョフー","コジョンド",
                 "クリムガン","ゴビット","ゴルーグ","コマタナ","キリキザン","バッフロン","ワシボン","ウォーグル","バルチャイ","バルジーナ",
                 "クイタラン","アイアント","モノズ","ジヘッド","サザンドラ","メラルバ","ウルガモス","コバルオン","テラキオン","ビリジオン",
                 "トルネロス","ボルトロス","レシラム","ゼクロム","ランドロス","キュレム","ケルディオ","メロエッタ","ゲノセクト"]
    #第6世代
    poke_name6 = ["ハリマロン",
                 "ハリボーグ","ブリガロン","フォッコ","テールナー","マフォクシー","ケロマツ","ゲコガシラ","ゲッコウガ","ホルビー","ホルード",
                 "ヤヤコマ","ヒノヤコマ","ファイアロー","コフキムシ","コフーライ","ビビヨン","シシコ","カエンジシ","フラベベ","フラエッテ",
                 "フラージェス","メェークル","ゴーゴート","ヤンチャム","ゴロンダ","トリミアン","ニャスパー","ニャオニクス","ヒトツキ","ニダンギル",
                 "ギルガルド","シュシュプ","フレフワン","ペロッパフ","ペロリーム","マーイーカ","カラマネロ","カメテテ","ガメノデス","クズモー",
                 "ドラミドロ","ウデッポウ","ブロスター","エリキテル","エレザード","チゴラス","ガチゴラス","アマルス","アマルルガ","ニンフィア",
                 "ルチャブル","デデンネ","メレシー","ヌメラ","ヌメイル","ヌメルゴン","クレッフィ","ボクレー","オーロット","バケッチャ",
                 "パンプジン","カチコール","クレベース","オンバット","オンバーン","ゼルネアス","イベルタル","ジガルデ","ディアンシー","フーパ",
                 "ボルケニオン"]
    #第7世代
    poke_name7 = ["モクロー","フクスロー","ジュナイパー","ニャビー","ニャヒート","ガオガエン","アシマリ","オシャマリ","アシレーヌ",
                 "ツツケラ","ケララッパ","ドデカバシ","ヤングース","デカグース","アゴジムシ","デンヂムシ","クワガノン","マケンカニ","ケケンカニ",
                 "オドリドリ","アブリー","アブリボン","イワンコ","ルガルガン","ヨワシ","ヒドイデ","ドヒドイデ","ドロバンコ","バンバドロ",
                 "シズクモ","オニシズクモ","カリキリ","ラランテス","ネマシュ","マシェード","ヤトウモリ","エンニュート","ヌイコグマ","キテルグマ",
                 "アマカジ","アママイコ","アマージョ","キュワワー","ヤレユータン","ナゲツケサル","コソクムシ","グソクムシャ","スナバァ","シロデスナ",
                 "ナマコブシ","タイプ:ヌル","シルヴァディ","メテノ","ネッコアラ","バクガメス","トゲデマル","ミミッキュ","ハギギシリ","ジジーロン",
                 "ダダリン","ジャラコ","ジャランゴ","ジャラランガ","カプ・コケコ","カプ・テテフ","カプ・ブルル","カプ・レヒレ","コスモッグ","コスモウム",
                 "ソルガレオ","ルナアーラ","ウツロイド","マッシブーン","フェローチェ","デンジュモク","テッカグヤ","カミツルギ","アクジキング","ネクロズマ",
                 "マギアナ","マーシャドー","ベベノム","アーゴヨン","ツンデツンデ","ズガドーン","ゼラオラ"]
    #GO
    poke_name_go = ["メルタン","メルメタル"]
    #第8世代
    poke_name8 = ["サルノリ",
                 "バチンキー","ゴリランダー","ヒバニー","ラビフット","エースバーン","メッソン","ジメレオン","インテレオン","ホシガリス","ヨクバリス",
                 "ココガラ","アオガラス","アーマーガア","サッチムシ","レドームシ","イオルブ","クスネ","フォクスライ","ヒメンカ","ワタシラガ",
                 "ウールー","バイウールー","カムカメ","カジリガメ","ワンパチ","パルスワン","タンドン","トロッゴン","セキタンザン","カジッチュ",
                 "アップリュー","タルップル","スナヘビ","サダイジャ","ウッウ","サシカマス","カマスジョー","エレズン","ストリンダー","ヤクデ",
                 "マルヤクデ","タタッコ","オトスパス","ヤバチャ","ポットデス","ミブリム","テブリム","ブリムオン","ベロバー","ギモー",
                 "オーロンゲ","タチフサグマ","ニャイキング","サニゴーン","ネギガナイト","バリコオル","デスバーン","マホミル","マホイップ","タイレーツ",
                 "バチンウニ","ユキハミ","モスノウ","イシヘンジン","コオリッポ","イエッサン","モルペコ","ゾウドウ","ダイオウドウ","パッチラゴン",
                 "パッチルドン","ウオノラゴン","ウオチルドン","ジュラルドン","ドラメシヤ","ドロンチ","ドラパルト","ザシアン","ザマゼンタ","ムゲンダイナ",
                 "ダクマ","ウーラオス","ザルード","レジエレキ","レジドラゴ","ブリザポス","レイスポス","バドレックス"]
    #LEGENDS
    poke_name_le = ["アヤシシ","バサギリ",
                    "ガチグマ","イダイトウ","ハリーマン","オオニューラ","ラブトロス"]
    #第9世代
    poke_name9 = ["ニャオハ","ニャローテ","マスカーニャ","ホゲータ","アチゲータ",
                 "ラウドボーン","クワッス","ウェルカモ","ウェーニバル","グルトン","パフュートン","タマンチュラ","ワナイダー","マメバッタ","エクスレッグ",
                 "パモ","パモット","パーモット","ワッカネズミ","イッカネズミ","パピモッチ","バウッツェル","ミニーブ","オリーニョ","オリーヴァ",
                 "イキリンコ","コジオ","ジオヅム","キョジオーン","カルボウ","グレンアルマ","ソウブレイズ","ズピカ","ハラバリー","カイデン",
                 "タイカイデン","オラチフ","マフィティフ","シルシュルー","タギングル","アノクサ","アノホラグサ","ノノクラゲ","リククラゲ","ガケガニ",
                 "カプサイジ","スコヴィラン","シガロコ","ベラカス","ヒラヒナ","クエスパトラ","カヌチャン","ナカヌチャン","デカヌチャン","ウミディグダ",
                 "ウミトリオ","オトシドリ","ナミイルカ","イルカマン","ブロロン","ブロロローム","モトトカゲ","ミミズズ","キラーメ","キラフロル",
                 "ボチ","ハカドッグ","カラミンゴ","アルクジラ","ハルクジラ","ミガルーサ","ヘイラッシャ","シャリタツ","コノヨザル","ドオー",
                 "リキキリン","ノココッチ","ドドゲザン","イダイナキバ","サケブシッポ","アラブルタケ","ハバタクカミ","チヲハウハネ","スナノケガワ","テツノワダチ",
                 "テツノツツミ","テツノカイナ","テツノコウベ","テツノドクガ","テツノイバラ","セビエ","セゴール","セグレイブ","コレクレー","サーフゴー",
                 "チオンジェン","パオジアン","ディンルー","イーユイ","トドロクツキ","テツノブジン","コライドン","ミライドン","ウネルミナモ","テツノイサハ"]
    #未
    # ["オーガポン","テラパゴス","イイネイヌ","マシマシラ","キチキギス"]

    if num>=1 && num<=151
        info = ["全国図鑑No."+num.to_s]
        info.push("生息：カントー地方")
        info.push("名前："+poke_name1[num-1])
    elsif num>=152 && num<=251
        info = ["全国図鑑No."+num.to_s]
        info.push("生息：ジョウト地方")
        info.push("名前："+poke_name2[num-152])
    elsif num>=252 && num<=386
        info = ["全国図鑑No."+num.to_s]
        info.push("生息：ホウエン地方")
        info.push("名前："+poke_name3[num-252])
    elsif num>=387 && num<=493
        info = ["全国図鑑No."+num.to_s]
        info.push("生息：シンオウ地方")
        info.push("名前："+poke_name4[num-387])
    elsif num>=494 && num<=649
        info = ["全国図鑑No."+num.to_s]
        info.push("生息：イッシュ地方")
        info.push("名前："+poke_name5[num-494])
    elsif num>=650 && num<=721
        info = ["全国図鑑No."+num.to_s]
        info.push("生息：カロス地方")
        info.push("名前："+poke_name6[num-650])
    elsif num>=722 && num<=807
        info = ["全国図鑑No."+num.to_s]
        info.push("生息：アローラ地方")
        info.push("名前："+poke_name7[num-722])
    elsif num>=808 && num<=809
        info = ["全国図鑑No."+num.to_s]
        info.push("生息?：GO")
        info.push("名前："+poke_name_go[num-808])
    elsif num>=810 && num<=898
        info = ["全国図鑑No."+num.to_s]
        info.push("生息：ガラル地方")
        info.push("名前："+poke_name8[num-810])
    elsif num>=899 && num<=905
        info = ["全国図鑑No."+num.to_s]
        info.push("生息?：アルセウス")
        info.push("名前："+poke_name_le[num-899])
    elsif num>=906 && num<=1010
        info = ["全国図鑑No."+num.to_s]
        info.push("生息：パルデア地方")
        info.push("名前："+poke_name9[num-906])
    else
        return ["存在しない図鑑番号です", "1~1010から指定してください"]
    end

    return info
end

def server s
    #path1:generation path2:pictorial
    cmd,path,ver = s.gets.chomp.split(" ")
    #cmd,path1,path2,ver = s.gets.chomp.split(" ")

    path0,path1,path2 = path.split("/")

    if path1 == "-g" #generation 世代指定
        #サーバー側
        puts cmd
        puts ver
        puts path1
        puts path2
        puts generation "#{path2}"

        #head ↓ここから
        s.puts "HTTP/1.1 200 OK"
        s.puts 'Content-Type: text/plain; charset="UTF-8"'
        s.puts

        #body ↓ここから
        s.puts generation "#{path2}" #メソッドgeneration呼び出し

        #if path2=="uni" #引数3つ目(pathの2つ目)がない時の処理
        #    s.puts "世代を指定してください"
        #else
        #    s.puts generation "#{path2}"
        #end

    elsif path1 == "-p" #number 図鑑No
        #サーバー側
        puts pictorial "#{path2}"

        #head ↓ここから
        s.puts "HTTP/1.1 200 OK"
        s.puts 'Content-Type: text/plain; charset="UTF-8"'
        s.puts

        #body ↓ここから
        s.puts pictorial "#{path2}" #メソッドpictorial呼び出し

    else
        #サーバー側
        puts "404 Not Found"

        #head ↓ここから
        s.puts "HTTP/1.1 404 Not Found"
        s.puts

        #body ↓ここから
        s.puts "404 Not Found"
    end

    s.close
end

gs=TCPServer.open 80

while true
    s=gs.accept
    Thread.new do
        server s
    end
end
